<html>
<body>
<br><img src="images/button_checkUp_de.jpg" align=right>
<h2>Check up Hilfe</h2>

<p>In der Check Up View k&ouml;nnen Sie Ihr  bisher erworbenes Wissen testen. Hier finden Sie verschiedene Formen von Fragen  zu den Inhalten aus der Text Study, der Slide Show oder anderen Views. </p>

<br><img src="images/screenShot_checkUp_de.jpg"></p>

<p>Um einen Check Up Durchlauf zu starten, m&uuml;ssen Sie ein Kapitel oder Element aus dem <a href="helpMainStructureTree_de.html">Strukturbaum</a> ausw&auml;hlen und die <em>&quot;Start&quot;</em>-Schaltfl&auml;che aus dem <a href="helpMainInteractionPanel_de.html">Interaction Panel</a> anklicken.
Anschliessend k&ouml;nnen Sie ausw&auml;hlen, in welcher Form Sie befragt werden m&ouml;chten, indem Sie in dem aufkommenden Dialog selektieren, welche Form der Abfrage erfolgen soll und mit einem Mausklick auf <em>"OK" </em>best&auml;tigen.

<p><img src="images/screenShot_checkUp_selectQuestion_de.jpg"></p>

<p>Im Structure Tree, finden Sie neben den Ordnern, grunds&auml;tzlich 2 verschiede Formen von Abfragem&ouml;glichkeiten: <a href="helpMultipleChoice_de.html">Multiple Choice</a> und <a href="helpRelatorElements_de.html">Relator Elemente</a>.</p>

<br><h3>&Uuml;bungsmodus</h3>

<p>Wenn Sie eine Fragendurchlauf im &Uuml;bungsmodus bearbeiten,  k&ouml;nnen Sie jederzeit ein beliebiges Element aus dem <a href="helpMainStructureTree_de.html">Struturbaum</a> ausw&auml;hlen, ohne den Fragendurchlauf  beenden zu m&uuml;ssen. Durch Dr&uuml;cken der <i>"Vor"-</i>  oder <i>"Zur&uuml;ck"-</i>Schaltfl&auml;che k&ouml;nnen Sie  wieder in den Fragendurchlauf einsteigen. Bevor jedoch zur n&auml;chsten Frage  gesprungen wird, werden Ihre Antworten ausgewertet und farblich markiert: gr&uuml;n  f&uuml;r korrekte Antworten und rot f&uuml;r nicht korrekte Antworten.</p>

<p><strong><em>Hinweis</em></strong><em>: Auch das <u>Nicht</u>-Beantworten  von <u>falschen</u> Antwortm&ouml;glichkeiten wird als <u>korrekte</u> Antwort  gewertet und geht in die Bewertung ein!</em></p>

<br><h3>Pr&uuml;fungsmodus</h3>

<p>Im Pr&uuml;fungsmodus wird die Baumansicht ausgeblendet, so dass w&auml;hrend des Durchlaufs keine anderen Elemente ausgew&auml;hlt werden k&ouml;nnen.  Au&szlig;erdem erhalten Sie keine optische R&uuml;ckmeldung dar&uuml;ber, ob eine Antwort  richtig oder falsch war. Dar&uuml;ber hinaus ist im Pr&uuml;fungsmodus die Bearbeitungsreihenfolge fest vorgegeben. Sie m&uuml;ssen erst den gesamten Fragendurchlauf beenden,  um die Ergebnisse zu den einzelnen Fragen im Evaluationsmodus zu betrachten.  Beim Beenden eines Fragendurchlaufs im Pr&uuml;fungsmodus wird automatisch zum <a href="helpEvaluationMode_de.html">Evaluationmodus</a> gewechselt.</p>

<br><p><b>View-spezifische  Interaktions-Schaltfl&auml;chen</b></p>

<table border="1">
  <tr>
    <td> <div align="center"><img src="images/button_start_de.gif"></div></td>
    <td>Fragendurchlauf starten</td>
    <td>Fragendurchlauf starten, bei dem das ausgew&auml;hlte Element und alle Unterelemente enthalten sind</td>
  </tr>
  <tr>
    <td><div align="center"><img src="images/button_stop_de.gif"></div></td>
    <td>Fragendurchlauf stoppen</td>
    <td>Aktuell gestarteten Fragendurchlauf stoppen</td>
  </tr>
  <tr>
    <td><div align="center"><img src="images/button_previousNextElement_de.gif"></div></td>
    <td>Vor / zur&uuml;ck</td>
    <td>W&auml;hrend eines Fragendurchlaufs zur vorigen<br>bzw. n&auml;chsten Frage springen</td>
  </tr>
  <tr>
    <td><div align="center"><img src="images/button_hint_de.gif"></div></td>
    <td>Hinweis</td>
    <td>Hinweis oder Kommentar des Autors anh&ouml;ren</td>
  </tr>
  <tr>
    <td><div align="center"><img src="images/button_evaluationMode_de.gif"></div></td>
    <td>Evaluationsmodus</td>
    <td>Zum <a href="helpEvaluationMode_de.html">Evaluationmodus</a> wechseln <br>
      und ggf. Fragendurchlauf beenden</td>
  </tr>
</table>
<p>
<hr>
<center>
<p>Zur&uuml;ck zur <a href="main">Hauptseite</a></p>
</center>
</body>
</html>