<html>
<body>

<br><img src="images/button_memory_en.jpg" width="36" height="36" align=right>
<h2>Memory-Modus</h2>
<p>Neben der Repr&auml;sentation von  Begriffen bietet die Glossary View im Memory-Modus die M&ouml;glichkeit, einzelne  Elemente in der Art eines Vokabeltrainings zu vertiefen. Im Rahmen einer  Memory-Sitzung werden Ihnen ausgew&auml;hlte Elemente pr&auml;sentiert, wobei zun&auml;chst jeweils  der Name oder der Inhalt des Glossarelements verdeckt ist und auf Knopfdruck  aufgedeckt werden kann. Anschlie&szlig;end k&ouml;nnen Sie die jeweiligen Elemente in  verschiedene Memory-Kategorien verschieben wodurch ein gezieltes Lernen  erm&ouml;glicht wird. </p>
<p><img src="images/screenShot_memory_de.jpg" alt="" width="480" height="354"></p>

<p>Um eine Memory- Sitzung  durchzuf&uuml;hren, wechseln Sie zun&auml;chst durch Klicken der<i>"Memory"</i>-Schaltfl&auml;che in den  Memory-Modus. Anschlie&szlig;end k&ouml;nnen Sie die Sitzung durch Bet&auml;tigen der <i>"Start"</i>-Schaltfl&auml;che beginnen. Geben Sie  im darauf hin erscheinenden Dialog ihre individuelle Lernstrategie an. Dabei  haben Sie die M&ouml;glichkeit, alle Elemente einer bestimmten Kategorie (<i>Start</i>,  <i>Light</i>, Medium sowie <i>Premium</i> &ndash; sortiert nach Schwierigkeitsgrad) zu wiederholen.  Alternativ kann ihre Sitzung auch die Elemente aufzeigen, die seit einem  anzugebenden Datum nicht wiederholt worden sind. Weiter m&uuml;ssen Sie im Dialog  angeben, ob im Folgenden Titel oder Inhalt zun&auml;chst angegeben werden. Dr&uuml;cken  Sie <em>&bdquo;OK&ldquo;</em> um die Memory Sitzung zu  starten.
<p><img src="images/screenShot_memory_dialog_de.jpg">

<p>In der Sitzung wird Ihnen  jeweils zuerst entweder der Titel oder der Inhalt pr&auml;sentiert. Als Lerner haben  Sie jetzt die M&ouml;glichkeit, zu &uuml;berlegen, was hinter dem aktuell verdeckten Bereich  liegt. Durch Bet&auml;tigen der <i>"Aufdecken"</i>-Schaltfl&auml;che  wird der Inhalt des verdeckten Bereichs aufgel&ouml;st. Um den aktuellen Durchlauf  abzuschlie&szlig;en, m&uuml;ssen Sie jetzt ihren Lernerfolg im System protokollieren.  Dabei haben Sie die M&ouml;glichkeit, das aufgedeckte Element in eine fortgeschrittene  Kategorie zu verschieben, es in der aktuellen zu belassen oder es wieder in  einer einfacheren einzuordnen.<br>
Nachdem alle Elemente der  aktuellen Sitzung angezeigt wurden, bekommen Sie eine Statistik angezeigt.  Durch bet&auml;tigen der <i>"Stop"</i>-Schaltfl&auml;che  wird die Memory-Sitzung abgeschlossen. Zus&auml;tzlich k&ouml;nnen Sie mit der <i>"Stop"</i>-Schaltfl&auml;che auch jederzeit w&auml;hrend eines Durchlaufs abbrechen.
<p><strong><i>Hinweis</i></strong><em>: Es findet keine  Lernkontrolle durch den Memory-Manager statt! Ob sie eine Zuordnung gewusst  haben oder nicht, best&auml;tigen manuell durch Zuordnung zu den entsprechenden Kategorien.</em>
<p><strong>Kategorien-Zuordnung</strong>
<table border="1">
  <tr>
    <td><div align="center"><img src="images/button_memory_uncover_de.gif"></div></td>
    <td>Aufdecken</td>
    <td>Deckt die nicht sichtbare Fl&auml;che des aktuellen Elements auf</td>
  </tr>
  <tr>
    <td><div align="center"><img src="images/button_memory_up_de.gif"></div></td>
    <td>Aufw&auml;rts</td>
    <td>Bewegt das aktuell bearbeitete Element eine Kategorie nach oben</td>
  </tr>
  <tr>
    <td><div align="center"><img src="images/button_memory_hold_de.gif"></div></td>
    <td>Belassen</td>
    <td>Bel&auml;sst  das aktuell bearbeitete Element in der urspr&uuml;nglichen Kategorie</td>
  </tr>
  <tr>
    <td><div align="center"><img src="images/button_memory_down_de.gif"></div></td>
    <td>Abw&auml;rts</td>
    <td>Bewegt das aktuell bearbeitete Element eine Kategorie nach unten</td>
  </tr>
</table>
<p>
<hr>
<center>
<p>Zur&uuml;ck zur <a href="main">Hauptseite</a></p>
</center>
</body>
</html>