<html>
<body>

<h2>Standard-Interaktions-Schaltfl&auml;chen</h2>
<p>Einige Perspektiven verwenden Schaltfl&auml;chen, die &uuml;ber die Plattform allgemein zur Verf&uuml;gung gestellt werden. Sie k&ouml;nnen f&uuml;r Standard-Aufgaben genutzt werden, wie z. B. zur Navigation durch die Baumansicht oder zur Aufteilung des Anzeigebereiches in zwei untereinander liegende Fensterbereiche <a href="helpMainSplitScreenMode_de.html">(Split Screen Modus)</a>. Sie finden die in der nachstehenden Tabelle aufgef&uuml;hrten Standard-Interaktionsschaltfl&auml;chen im linken Bereich der Interaktionsleiste.</p>
<p>
<table width="747" height="152" border="1">
  <tr>
    <td width="92"><div align="center"><img src="images/button_splitModeOnOff_de.png" alt="" width="38" height="40"></div></td>
    <td width="154"> Bildschirmteilung</td>
    <td width="479"> Ein- oder Ausschalten der Bildschirmteilung <a href="helpMainSplitScreenMode_de.html">(Split Screen Modus) </a></td>
  </tr>
  <tr>
    <td><div align="center"><img src="images/button_splitModeSwitch_de.png" alt="" width="40" height="40"></div></td>
    <td>Aktives  Fenster wechseln</td>
    <td>Wechsel zwischen dem aktiven und inaktiven <a href="helpMainContentPanel_de.html">Content Panel</a></td>
  </tr>
  <tr>
    <td><div align="center"><img src="images/button_previousNextElement_de.png" alt="" width="81" height="40"></div></td>
    <td>Baumansicht Navigation</td>
    <td>Navigieren zwischen den Elementen des <a href="helpMainStructureTree_de.html">Structure Trees</a></td>
  </tr>
  <tr>
    <td><div align="center"><img src="images/button_fullScreen_de.png" alt="" width="40" height="40"></div></td>
    <td>Vollbild-Modus</td>
    <td> Wechsel zwischen dem <a href="helpMainScreenMode_de.html">Vollbildmodus und Fenstermodus</a>, z.B. bei dem Betrachten eines Intro-Videos</td>
  </tr>
  <tr>
    <td><div align="center"><img src="images/button_scaleMode_de.png" alt="" width="41" height="40"></div></td>
    <td>Skalierungs-Modus</td>
    <td>Zwischen skalierter und Original-Ansicht  wechseln </td>
  </tr>
</table>
</p>
<p>Welche dieser Schaltfl&auml;chen tats&auml;chlich vorhanden sind, h&auml;ngt davon ab, ob eine Perspektive diese Funktionalit&auml;ten unterst&uuml;tzen m&ouml;chte. </p>
<p><strong>View-spezifische Interaktionsschaltfl&auml;chen </strong></p>
<p>Neben den Standard Interaktions-Schaltfl&auml;chen kann eine Perspektive (View) beliebige neue Interaktions-Schaltfl&auml;chen der Interaktionsleiste hinzuf&uuml;gen, um weitere, der Pr&auml;sentation entsprechende Interaktions-M&ouml;glichkeiten zu realisieren. Solche View-spezifischen Interaktions-Schaltfl&auml;chen sind nur in einer bestimmten View zu finden, wie z. B. Abspiel- und Stopp-Schaltf&auml;chen bei Multimedia-Elementen.</p>
<p>
<hr>
<center>
<P>Zur&uuml;ck zur <a href="main">Hauptseite</a></p>
</center>
</body>
</html>