<html>
<body>
<h2>Auswahl einer Learning Unit View</h2>
<p>Nach einer Learning Unit-Auswahl werden die Learning Unit-Perspektiven (Views) und deren Lerninhalte geladen. Dieser Prozess wird durch eine Fortschrittsanzeige symbolisiert. Welche der Views zur Auswahl stehen, h&auml;ngt davon ab, ob sie in einer bestimmten Learning Unit unterst&uuml;tzt werden.</p>
<p><img src="images/screenShot_selectUnitView_de.jpg"></p>
<p><strong>Primary Activation Buttons </strong></p>
<p>Im linken, unteren Fensterbereich sind eine Reihe von so genannten Primary Activation Buttons angeordnet. &Uuml;ber diese Schaltfl&auml;chen k&ouml;nnen Sie sich Ihren eigenen Weg zum Bearbeiten der Lerninhalte bahnen. &Uuml;blicherweise f&uuml;hren Ihre ersten Schritte bei einer Learning Unit durch diese prim&auml;ren Perspektiven (primary views), in denen  Sie sich intensiv mit dem Lerninhalt auseinandersetzen und sich sowohl Grund- als auch Detailkenntnisse aneignen und &uuml;berpr&uuml;fen k&ouml;nnen. </p>
<p><strong>Secondary Activation Buttons </strong></p>
<p>In der Toolbar unterhalb der Menuleiste finden Sie Schaltfl&auml;chen zur Aktivierung von sekund&auml;ren Perspektiven, den Secondary Views. &Uuml;ber diese Schaltfl&auml;chen gelangen Sie zu Perspektiven, in denen zus&auml;tzliches Material, Multimedia-Elemente, Notizen oder beliebige andere Nachschlage-Referenzen strukturiert aufbereitet sein k&ouml;nnen.</p>
<p><em><strong>Hinweis: </strong>Wenn Sie Freestyle Learning starten, sind zun&auml;chst alle Perspektiven deaktiviert. Sobald Sie eine Learning Unit geladen haben, werden die spezifischen Perspektiven angezeigt und lassen sich durch Anklicken der Primary Activation Buttons oder Secondary Activation Buttos in der Toolbar starten. Sie k&ouml;nnen sich beliebig durch Dr&uuml;cken der Primary und Secondary Activaton Buttons durch die einzelnen View Manager navigieren.</em></p>
<p>
<hr>
<center>
<p>Zur&uuml;ck zur <a href="main">Hauptseite</a></p>
</center>
</body>
</html>