<html>
<body>
<h2>Guided Tours</h2>
<p>Eine Guided Tour ist eine Abfolge von Elementen, die den  Lernenden hinsichtlich bestimmter Fragestellungen durch eine Learning Unit  f&uuml;hren. Sie hilft, einen Ansatz zu finden oder weist einen Weg zur L&ouml;sung. Der  Tour Creator l&auml;sst sich &uuml;ber den Men&uuml;eintrag <i>"Learning Unit / Tour Creator"</i> anzeigen. Es erscheint ein zus&auml;tzliches Programmfenster, in  dem Guided Tours ausgew&auml;hlt und gestartet werden k&ouml;nnen. </p>
<p><img src="images/screenShotGuidedTours_de.jpg" width="523" height="360" align=left></p>
<p>&nbsp;</p>
<p>Bevor Sie  eine Tour starten, w&auml;hlen Sie einen Eintrag aus dem Auswahlfeld im Fenster des  Tour Creators. Daraufhin erscheinen im unteren Bereich die Elemente, die zu der  ausgew&auml;hlten Tour geh&ouml;ren.</p>
<p>Zum Starten der Tour klicken Sie auf das blaue Abspielsymbol  in der Toolbar. Das Fenster des Tour Creators wechselt darauf in den <em>Pr&auml;sentationsmodus</em>. Im Pr&auml;sentationsmodus  ist das Fenster kleiner und st&ouml;rt so nicht beim Betrachten der Elemente einer  Tour, welche im Programmfenster von Freestyle Learning angezeigt werden. </p>
<p><img src="images/screenShotGuidedToursPlayer_de.jpg" width="266" height="161"></p>
<p>Mit dem Schieberegler k&ouml;nnen Sie im Pr&auml;sentationsmodus eine  Schnellauswahl von Elementen der Tour vornehmen. Im unteren Fensterbereich  sehen Sie eine Vorschau des Elements sowie die zugeh&ouml;rigen Beschreibungsdaten.  Lassen Sie den Schieberegler los, wird das ausgew&auml;hlte Element in Freestyle  Learning angezeigt. Noch Platz sparender ist es, wenn auch das Vorschaufenster  ausgeblendet wird. Dr&uuml;cken Sie dazu auf die entsprechende Schaltfl&auml;che in der  Toolbar. </p>
<p>
  Der Ablauf einer Tour kann zeitgesteuert oder manuell  erfolgen. Eine zeitgesteuerte Pr&auml;sentation starten Sie durch Klick auf die  Abspielschaltfl&auml;che. Jedes Element wird so lange angezeigt, wie es in den  Elementeigenschaften vorgegeben ist. Sie k&ouml;nnen die Pr&auml;sentation jederzeit  durch erneutes Dr&uuml;cken der Abspieltaste anhalten und wieder fortsetzen. Bei  manuellem Ablauf wird das n&auml;chste Tourelement durch Dr&uuml;cken der Pfeiltaste  angezeigt. Die Auswahl &uuml;ber die Pfeiltasten funktioniert auch bei zeitgesteuertem  Ablauf. </p>
<p><b>Schaltfl&auml;chen im Pr&auml;sentationsmodus</b></p>
<table border="1" cellspacing="0" cellpadding="0" width="612">
  <tr>
    <td width="91"><p align="center"><img src="images/helpMainGuidedTours_de_clip_image002.gif" alt="1" width="37" height="37"></p></td>
    <td width="186"><p>Zum Anfang der Tour</p></td>
    <td width="335"><p>Stoppt die    Pr&auml;sentation einer Tour und setzt den Schieberegler an den Anfang zur&uuml;ck</p></td>
  </tr>
  <tr>
    <td width="91"><p align="center"><img src="images/helpMainGuidedTours_de_clip_image004.gif" alt="2" width="80" height="39"></p></td>
    <td width="186"><p>Voriges / n&auml;chstes Element</p></td>
    <td width="335"><p>Zeigt das    vorhergehende bzw. nachfolgende Element der Tour an</p></td>
  </tr>
  <tr>
    <td width="91"><p align="center"><img src="images/helpMainGuidedTours_de_clip_image006.gif" alt="3" width="37" height="37"> </p></td>
    <td width="186"><p>Tour starten</p></td>
    <td width="335"><p>Startet die    Pr&auml;sentation einer zeitgesteuerten Tour</p></td>
  </tr>
  <tr>
    <td width="91"><p align="center"><img src="images/helpMainGuidedTours_de_clip_image008.gif" alt="4" width="37" height="37"> </p></td>
    <td width="186"><p>Tour fortsetzen</p></td>
    <td width="335"><p>Wird bei angehaltener    Tour angezeigt. Setzt die Pr&auml;sentation einer zeitgesteuerten Tour fort.</p></td>
  </tr>
  <tr>
    <td width="91"><p align="center"><img src="images/helpMainGuidedTours_de_clip_image010.gif" alt="5" width="39" height="39"></p></td>
    <td width="186"><p>Elementvorschau</p></td>
    <td width="335"><p>Blendet im    Pr&auml;sentationsmodus die Elementvorschau ein bzw. aus</p></td>
  </tr>
</table>
<p><i><b>Hinweis:</b> Jederzeit besteht die M&ouml;glichkeit die Guided Tours zu erweitern oder eigene Guided Tours zu <a href="helpMainCreateGuidedTours_de.html">erstellen</a></i>.</p>
<p>
<hr>
<center>
<p>Zurück zur <a href="main">Hauptseite</a></p>
</center>
</body>
</html>