<html>
<body>
<h2>Import und Export von Learning Units</h2>
<p><strong>Importieren einer Learning Unit </strong></p>
<p>Lerninhalte k&ouml;nnen in Form von Learning Units f&uuml;r die Freestyle Learning-Plattform zum Download angeboten werden, z. B. &uuml;ber eine entsprechende Veranstaltung, die auf der Online-Plattform OpenUSS  eingerichtet ist. Der Download einer Unit erfolgt in einer einzigen Datei mit der Endung .fsl (zip-Format). Zum Importieren einer Unit aus einer .fsl-Datei w&auml;hlen Sie den Men&uuml;punkt <em>"Datei / Importieren"</em>. Im darauf erscheinenden Dialog werden Sie zur Auswahl einer .fsl-Datei aufgefordert. Best&auml;tigen Sie Ihre Auswahl, um den Import-Prozess zu starten. Nach erfolgreichem Import k&ouml;nnen Sie die neue Unit &uuml;ber den Learning Unit-Auswahldialog aktivieren. </p>
<p><em><strong>Hinweis:</strong> Beachten Sie, dass ein Import einer Unit mit bereits auf Ihrer Plattform verwendeter ID derzeitig nur m&ouml;glich ist, wenn zuvor die existierende Unit mit der gleichen ID gel&ouml;scht wurde. </em></p>
<p><strong>Exportieren einer Learning Unit </strong></p>
<p>Sofern Sie in der Autorrolle angemeldet sind, k&ouml;nnen Sie Ihre Units &uuml;ber die Exportfunktion leicht anderen Nutzern von Freestyle Learning zur Verf&uuml;gung stellen. Aktivieren Sie dazu die zu exportierende Unit &uuml;ber den Learning Unit-Auswahldialog und w&auml;hlen Sie im Men&uuml; <em>"Datei / Exportieren"</em>. Alternativ k&ouml;nnen Sie im Learning Unit-Auswahldialog eine Unit rechtsklicken und <em>"Exportieren"</em> w&auml;hlen.  Im darauf erscheinenden Dialog k&ouml;nnen Sie einen Namen f&uuml;r die .fsl-Datei festlegen und den Exportvorgang starten. Diese Datei k&ouml;nnen Sie dann z. B. f&uuml;r andere Nutzer von Freestyle Learning zum Download anbieten, so dass diese sie wiederum &uuml;ber die Importfunktion bei sich nutzen k&ouml;nnen. </p>
<p><em><strong>Hinweis:</strong> Beachten Sie, dass eine exportiere Unit keine Links auf Elemente von Units enth&auml;lt, die bei den importierenden Installationen ggf. nicht vorhanden sind. Solche Links k&ouml;nnen dann nach dem Importieren nicht aufgel&ouml;st werden.</em></p>
<p>

<hr>
<center>
<p>Zur&uuml;ck zur <a href="main">Hauptseite</a></p>
</center>
</body>
</html>